CSI API ETABS v1
cAnalyze.ModifyUndeformedGeometry Method
 Modifies the undeformed geometry based on displacements obtained from a specified load case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ModifyUndeformedGeometry(
	string CaseName,
	double SF,
	int Stage = -1,
	bool Original = false
)
Function ModifyUndeformedGeometry (
	CaseName As String,
	SF As Double,
	Optional Stage As Integer = -1,
	Optional Original As Boolean = false
) As Integer
Dim instance As cAnalyze
Dim CaseName As String
Dim SF As Double
Dim Stage As Integer
Dim Original As Boolean
Dim returnValue As Integer
returnValue = instance.ModifyUndeformedGeometry(CaseName,
	SF, Stage, Original)
int ModifyUndeformedGeometry(
	String^ CaseName,
	double SF,
	int Stage = -1,
	bool Original = false
)
abstract ModifyUndeformedGeometry :
        CaseName : string *
        SF : float *
        ?Stage : int *
        ?Original : bool
(* Defaults:
        let _Stage = defaultArg Stage -1
        let _Original = defaultArg Original false
*)
-> int
Parameters
CaseName
Type: System.String
 The name of the static load case from which displacements are obtained.
SF
Type: System.Double
 The scale factor applied to the displacements.
Stage (Optional)
Type: System.Int32
 This item applies only when the specified load case is a staged construction load case. It is the stage number from which the displacements are obtained. Specifying a -1 for this item means to use the last run stage.
Original (Optional)
Type: System.Boolean
 If this item is True, all other input items in this function are ignored and the original undeformed geometry data is reinstated.
Return Value
Type: Int32
 Returns zero if it is successful; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'assign point object restraints
       ReDim Value(5)
       For i = 0 To 5
           Value(i) = True
       Next i
       ret = SapModel.PointObj.SetRestraint("1", Value)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis
   'modify undeformed geometry
       ret = SapModel.Analyze.ModifyUndeformedGeometry("DEAD", 1)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace